app/views/renters/index.html.erb

  <% @renters.each do |renter| %>
    <li><%= renter.first_name %> <%= renter.last_name %>: <%= renter.unit.name %></li>
---
SELECT  "units".* FROM "units" WHERE "units"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]


Average Cost Per Square Foot For All Renters: $<%= @renters.map { |renter| renter.unit.cost_per_square_foot.to_i }.sum / @renters.count %>
---
SELECT AVG("units"."cost_per_square_foot") FROM "units"