app/views/owners/index.html.erb

SELECT "units".* FROM "units" WHERE "units"."owner_id" = $1  [["owner_id", 13]]
---
      <ul>
        <% owner.units.each do |unit| %>