app/views/owners/show.html.erb


<% @owner.units.each do |unit| %>
---
SELECT  "units".* FROM "units" WHERE "units"."owner_id" = $1 AND "units"."id" = $2 LIMIT $3  [["owner_id", 5], ["id", nil], ["LIMIT", 1]]
SELECT SUM() FROM "units" WHERE "units"."owner_id" = $1  [["owner_id", 7]]